_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 128, 128, 4)       76        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 64, 4)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 8)         296       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 32, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 16)        1168      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 64, 64, 4)         580       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 128, 128, 1)       37        
=================================================================
Total params: 4,477
Trainable params: 4,477
Non-trainable params: 0
_________________________________________________________________